WELCOME = "👋 Привет, {name}! 😊\n\nДобро пожаловать на телеграм бота чатика лапасьончииикаа! 🎉\n\n💖 Любим, ценим, обнимаем! ❤️\n\nВыберите действие ниже:"

USERS_LIST_PROMPT = "👥 Список анкет — выберите пользователя:"

NO_USERNAME_ERROR = "⚠️ Для создания анкеты нужен username в профиле Telegram. 📝\nПожалуйста, установите username и повторите." 

PROFILE_SAVED = "✅ Анкета сохранена и добавлена в список." 
PROFILE_SUBMITTED_FOR_REVIEW = "📋 Анкета сохранена и отправлена на модерацию.\n⏳ Администратор скоро просмотрит её."

REPORT_ACCEPTED = "✅ Репорт принят! 📬\nID: {rid}"

REPORT_CANCELLED = "❌ Отмена репорта."

PROFILE_NOT_FOUND = "🔍 Пользователь не найден." 

DELETE_CONFIRM_PROMPT = "⚠️ Вы уверены? Подтвердите удаление пользователя @{username}."

ADMINS_LIST = """👑 Админы:

Ст. Админы:
1. @thebitsamuraiizz
2. @denji_kuni
3. @Canella_S

Мл. Админы:
1. @kixxzzl

Создатель: @L9g9nda"""

PROFILE_EXAMPLE = """📝 Образец анкеты:

👤 Имя: ??? (необязательно)
🎂 Возраст: ?? (обязательно)
🕐 Час. пояс: ?? к/от мск
   (Пример: если у вас 20.00, а в москве 21.00 то это -1 от мск)
🌍 Страна: ???

💡 Пишите в любом формате, главное указать возраст и часовой пояс!"""
